sbhakim/IoT_with_nRF52/ble_uart-Step-Counter/main.c
 /* -------------- added_separately_for_project_step_counter --------------*/
 
 
 #define SPI_INSTANCE 0 // SPI instance index. We use SPI master 0
 #define SPI_SS_PIN 6
 #define SPI_MISO_PIN 5
 #define SPI_MOSI_PIN 7
 #define SPI_SCK_PIN 8
 #define INT_PIN 11
 
 
 struct bmi160_dev sensor;                  
 struct bmi160_int_settg int_config;
 
 //SPI instance
 static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);
 //Flag used to indicate that SPI instance completed the transfer
 static volatile bool spi_xfer_done; 
 
 
 static uint8_t SPI_RX_Buffer[100]; // Allocate a buffer for SPI reads
 
 
 /* Function prototypes */
 uint32_t spi_config(void); 
 void spi_event_handler(nrf_drv_spi_evt_t const * p_event, void * p_context);
 int8_t bmi160_spi_bus_write(uint8_t hw_addr, uint8_t reg_addr, uint8_t *reg_data, uint16_t cnt);
 int8_t bmi160_spi_bus_read(uint8_t hw_addr, uint8_t reg_addr, uint8_t *reg_data, uint16_t len);
 int8_t sensor_config(void);
 uint32_t config_gpio(void);
 void interrupt_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action);
 
 /* -------------- added_separately_for_project_step_counter --------------*/
 
 
 BLE_NUS_DEF(m_nus);                                                                 /**< BLE NUS service instance. */
 NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
 BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
 
 static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
 static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
 static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
 {
     
     {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
 };
 
 
 /**@brief Function for assert macro callback.
  *
  * @details This function will be called in case of an assert in the SoftDevice.
  *
  * @warning This handler is an example only and does not fit a final product. You need to analyse
  *          how your product is supposed to react in case of Assert.
  * @warning On assert from the SoftDevice, the system can only recover on reset.
  *
  * @param[in] line_num    Line number of the failing ASSERT call.
  * @param[in] p_file_name File name of the failing ASSERT call.
  */
 void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
 {
     app_error_handler(DEAD_BEEF, line_num, p_file_name);
 }
 
 
 /* -------------- added_separately_for_project_step_counter --------------*/
 
 /**
 * Function for setting up the SPI communication.
 */
 uint32_t spi_config()
 {
     uint32_t err_code;
 
     // Use nRF's default configurations
     nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
      // Define each GPIO pin
     spi_config.ss_pin = SPI_SS_PIN;
     spi_config.miso_pin = SPI_MISO_PIN;
     spi_config.mosi_pin = SPI_MOSI_PIN;
     spi_config.sck_pin = SPI_SCK_PIN;
 
     // Initialize the SPI peripheral and give it a function pointer to
     // it’s event handler
     err_code = nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL);
 
     return err_code;
 }
 
 
 uint32_t config_gpio()
 {
     uint32_t err_code = NRF_SUCCESS;
     if(!nrf_drv_gpiote_is_init())
     {
          err_code = nrf_drv_gpiote_init();
     }
     // Set which clock edge triggers the interrupt
     nrf_drv_gpiote_in_config_t config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
     // Configure the internal pull up resistor
     config.pull = NRF_GPIO_PIN_PULLUP;
 
      // Configure the pin as input
     err_code = nrf_drv_gpiote_in_init(INT_PIN, &config, interrupt_handler);
     if (err_code != NRF_SUCCESS)
     {
     // handle error condition
     }
     // Enable events
     nrf_drv_gpiote_in_event_enable(INT_PIN, true);
     return err_code;
 }
 
 
 void interrupt_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
 {
    
 
     /* When there is interuupt read the step counter */
     int8_t rslt = BMI160_OK;
     uint16_t step_count = 0;//stores the step counter value
     
     
     rslt = bmi160_read_step_counter(&step_count,  &sensor);
 
     printf("%d\n", rslt);
 }
 
 
 /* -------------- added_separately_for_project_step_counter --------------*/
 
 /* -------------- added_separately_for_project_step_counter --------------*/
 
 /**
 * Function for reading from the BMI160 via SPI.
 */
 int8_t bmi160_spi_bus_read(uint8_t hw_addr, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)
     {
      spi_xfer_done = false; // set the flag down during transfer
      int32_t error = 0;
      uint8_t tx_buff = reg_addr | 0x80; // OR address with 1000 0000; Read -> set msb to '1';
      uint8_t * rx_buff_pointer;
      uint8_t stringpos;
      rx_buff_pointer = (uint8_t *) (SPI_RX_Buffer);
     
      // Do the actual SPI transfer
      nrf_drv_spi_transfer(&spi, &tx_buff, 1, rx_buff_pointer, len+1);
     
      while (!spi_xfer_done) {} // Loop until the transfer is complete
      // Copy received bytes to reg_data
      for (stringpos = 0; stringpos < len; stringpos++)
      *(reg_data + stringpos) = SPI_RX_Buffer[stringpos + 1];
     
      return (int8_t)error;
     }
 
 
 
 
 /**
 * Function for writing to the BMI160 via SPI.
 */
 int8_t bmi160_spi_bus_write(uint8_t hw_addr, uint8_t reg_addr, uint8_t *reg_data,
     uint16_t cnt)
     {
      spi_xfer_done = false; // set the flag down during transfer
     
      int32_t error = 0;
      // Allocate array, which lenght is address + number of data bytes to be sent
      uint8_t tx_buff[cnt+1];
     
      uint16_t stringpos;
      // AND address with 0111 1111; set msb to '0' (write operation)
      tx_buff[0] = reg_addr & 0x7F;
     
      for (stringpos = 0; stringpos < cnt; stringpos++) {
      tx_buff[stringpos+1] = *(reg_data + stringpos);
      }
      // Do the actual SPI transfer
      nrf_drv_spi_transfer(&spi, tx_buff, cnt+1, NULL, 0);
     
      while (!spi_xfer_done) {}; // Loop until the transfer is complete
     
      return (int8_t)error;
     }
 
 
 
 /**
 * SPI user event handler.
 */
 void spi_event_handler(nrf_drv_spi_evt_t const * p_event, void * p_context)
    {
     spi_xfer_done = true; // Set a flag when transfer is done
    }
    
 
