sbhakim/IoT_with_nRF52/ble_uart-Step-Counter/main.c
 /**@brief Function for the SoftDevice initialization.
  *
  * @details This function initializes the SoftDevice and the BLE event interrupt.
  */
 static void ble_stack_init(void)
 {
     ret_code_t err_code;
 
     err_code = nrf_sdh_enable_request();
     APP_ERROR_CHECK(err_code);
 
     // Configure the BLE stack using the default settings.
     // Fetch the start address of the application RAM.
     uint32_t ram_start = 0;
     err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
     APP_ERROR_CHECK(err_code);
 
     // Enable BLE stack.
     err_code = nrf_sdh_ble_enable(&ram_start);
     APP_ERROR_CHECK(err_code);
 
     // Register a handler for BLE events.
     NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
 }
 
 
 /**@brief Function for handling events from the GATT library. */
 void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
 {
     if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
     {
         m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
         NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
     }
     NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                   p_gatt->att_mtu_desired_central,
                   p_gatt->att_mtu_desired_periph);
 }
 
 
 /**@brief Function for initializing the GATT library. */
 void gatt_init(void)
 {
     ret_code_t err_code;
 
     err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
     APP_ERROR_CHECK(err_code);
 
     err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 64);
     APP_ERROR_CHECK(err_code);
 }
 
 
 /**@brief Function for handling events from the BSP module.
  *
  * @param[in]   event   Event generated by button press.
  */
 void bsp_event_handler(bsp_event_t event)
 {
     uint32_t err_code;
     switch (event)
     {
         case BSP_EVENT_SLEEP:
             sleep_mode_enter();
             break;
 
         case BSP_EVENT_DISCONNECT:
             err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
             if (err_code != NRF_ERROR_INVALID_STATE)
             {
                 APP_ERROR_CHECK(err_code);
             }
             break;
 
         case BSP_EVENT_WHITELIST_OFF:
             if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
             {
                 err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                 if (err_code != NRF_ERROR_INVALID_STATE)
                 {
                     APP_ERROR_CHECK(err_code);
                 }
             }
             break;
 
         default:
             break;
     }
 }
 
 
 /**@brief   Function for handling app_uart events.
  *
  * @details This function will receive a single character from the app_uart module and append it to
  *          a string. The string will be be sent over BLE when the last character received was a
  *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
  */
 /**@snippet [Handling the data received over UART] */
 void uart_event_handle(app_uart_evt_t * p_event)
 {
     static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
     static uint8_t index = 0;
     uint32_t       err_code;
 
     switch (p_event->evt_type)
     {
         case APP_UART_DATA_READY:
             UNUSED_VARIABLE(app_uart_get(&data_array[index]));
             index++;
 
             if ((data_array[index - 1] == '\n') || (index >= (m_ble_nus_max_data_len)))
             {
                 NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                 NRF_LOG_HEXDUMP_DEBUG(data_array, index);
 
                 do
                 {
                     uint16_t length = (uint16_t)index;
                     err_code = ble_nus_string_send(&m_nus, data_array, &length);
                     if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_BUSY) )
                     {
                         APP_ERROR_CHECK(err_code);
                     }
                 } while (err_code == NRF_ERROR_BUSY);
 
                 index = 0;
             }
             break;
 
         case APP_UART_COMMUNICATION_ERROR:
             APP_ERROR_HANDLER(p_event->data.error_communication);
             break;
 
         case APP_UART_FIFO_ERROR:
             APP_ERROR_HANDLER(p_event->data.error_code);
             break;
 
         default:
             break;
     }
 }
 /**@snippet [Handling the data received over UART] */
 
 
 /**@brief  Function for initializing the UART module.
  */
 /**@snippet [UART Initialization] */
 static void uart_init(void)
 {
     uint32_t                     err_code;
     app_uart_comm_params_t const comm_params =
     {
         .rx_pin_no    = RX_PIN_NUMBER,
         .tx_pin_no    = TX_PIN_NUMBER,
         .rts_pin_no   = RTS_PIN_NUMBER,
         .cts_pin_no   = CTS_PIN_NUMBER,
         .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
         .use_parity   = false,
         .baud_rate    = NRF_UART_BAUDRATE_115200
     };
 
     APP_UART_FIFO_INIT(&comm_params,
                        UART_RX_BUF_SIZE,
                        UART_TX_BUF_SIZE,
                        uart_event_handle,
                        APP_IRQ_PRIORITY_LOWEST,
                        err_code);
     APP_ERROR_CHECK(err_code);
 }
 /**@snippet [UART Initialization] */
 
 
 
 
 /* -------------- added_separately_for_project_step_counter --------------*/
 /**
 * Function for configuring the sensor
 */
 int8_t sensor_config()
 {
     int8_t rslt = BMI160_OK;
     uint8_t step_enable = 1;//enable the step counter
 
 
     sensor.id = 0; // We use SPI so id == 0
     sensor.interface = BMI160_SPI_INTF;
     // Give the driver the correct interfacing functions
     sensor.read = bmi160_spi_bus_read;
     sensor.write = bmi160_spi_bus_write;
     sensor.delay_ms = nrf_delay_ms;
     // Initialize the sensor and check if everything went ok
     rslt = bmi160_init(&sensor);
 
 
     
 
 
     /* Select the Interrupt channel/pin */
     int_config.int_channel = BMI160_INT_CHANNEL_1;// Interrupt channel/pin 1
 
     /* Select the Interrupt type */
     int_config.int_type = BMI160_STEP_DETECT_INT;// Choosing Step Detector interrupt
     /* Select the interrupt channel/pin settings */
     int_config.int_pin_settg.output_en = BMI160_ENABLE;// Enabling interrupt pins to act as output pin
     int_config.int_pin_settg.output_mode = BMI160_DISABLE;// Choosing push-pull mode for interrupt pin
     int_config.int_pin_settg.output_type = BMI160_ENABLE;// Choosing active High output
     int_config.int_pin_settg.edge_ctrl = BMI160_ENABLE;// Choosing edge triggered output
     int_config.int_pin_settg.input_en = BMI160_DISABLE;// Disabling interrupt pin to act as input
     int_config.int_pin_settg.latch_dur =BMI160_LATCH_DUR_NONE;// non-latched output
 
     /* Select the Step Detector interrupt parameters, Kindly use the recommended settings for step detector */
     int_config.int_type_cfg.acc_step_detect_int.step_detector_mode = BMI160_STEP_DETECT_NORMAL;
     int_config.int_type_cfg.acc_step_detect_int.step_detector_en = BMI160_ENABLE;// 1-enable, 0-disable the step detector
 
     /* Set the Step Detector interrupt */
     rslt = bmi160_set_int_config(&int_config, &sensor); /* sensor is an instance of the structure bmi160_dev */
 
     
 
 
     /* settting the step counter */
     
     rslt = bmi160_set_step_counter(step_enable,  &sensor);
     return rslt;
 }
 
