sbhakim/IoT_with_nRF52/ble_uart-Step-Counter/main.c
 /* -------------- added_separately_for_project_step_counter --------------*/
 
 
 
 
 
 /**@brief Function for initializing the Advertising functionality.
  */
 static void advertising_init(void)
 {
     uint32_t               err_code;
     ble_advertising_init_t init;
 
     memset(&init, 0, sizeof(init));
 
     init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
     init.advdata.include_appearance = false;
     init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
 
     init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
     init.srdata.uuids_complete.p_uuids  = m_adv_uuids;
 
     init.config.ble_adv_fast_enabled  = true;
     init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
     init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
 
     init.evt_handler = on_adv_evt;
 
     err_code = ble_advertising_init(&m_advertising, &init);
     APP_ERROR_CHECK(err_code);
 
     ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
 }
 
 
 /**@brief Function for initializing buttons and leds.
  *
  * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
  */
 static void buttons_leds_init(bool * p_erase_bonds)
 {
     bsp_event_t startup_event;
 
     uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
     APP_ERROR_CHECK(err_code);
 
     err_code = bsp_btn_ble_init(NULL, &startup_event);
     APP_ERROR_CHECK(err_code);
 
     *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
 }
 
 
 /**@brief Function for initializing the nrf log module.
  */
 static void log_init(void)
 {
     ret_code_t err_code = NRF_LOG_INIT(NULL);
     APP_ERROR_CHECK(err_code);
 
     NRF_LOG_DEFAULT_BACKENDS_INIT();
 }
 
 
 /**@brief Function for placing the application in low power state while waiting for events.
  */
 static void power_manage(void)
 {
     uint32_t err_code = sd_app_evt_wait();
     APP_ERROR_CHECK(err_code);
 }
 
 
 /**@brief Application main function.
  */
 int main(void)
 {
     uint32_t err_code;
     bool     erase_bonds;
 
     // Initialize.
     err_code = app_timer_init();
     APP_ERROR_CHECK(err_code);
 
     uart_init();
     log_init();
 
     buttons_leds_init(&erase_bonds);
     ble_stack_init();
     gap_params_init();
     gatt_init();
     services_init();
     advertising_init();
     conn_params_init();
 
 
     /* -------------- added_separately_for_project_step_counter --------------*/
     spi_config(); 
     sensor_config();
     config_gpio();
     /* -------------- added_separately_for_project_step_counter --------------*/
 
 
     printf("\r\nUART Start!\r\n");
     NRF_LOG_INFO("UART Start!");
     err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
     APP_ERROR_CHECK(err_code);
 
     // Enter main loop.
     for (;;)
     {
         UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
         power_manage();
     }
 }
 
 
 /**
  * @}
  */
 